# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#
# *Пример:*
#
# - [2, 3, 4, 5, 6] =>[12,15,16]      ([2*6, 3*5, 4*4]);
# - [2, 3, 5, 6] => [12,15]   ( [2*6, 3*5])


ls = [i for i in range(5)]
print(ls)
ls_ans = []
k = -1
for i in range(len(ls) // 2):
    ls_ans.append(ls[i] * ls[k])
    k = k - 1
    if i == abs(k) - 1:
        break
print(ls_ans)
