# Задайте последовательность чисел. Напишите программу, которая выведет список
# неповторяющихся элементов исходной последовательност


ls = [2, 2, 1, 1, 3, 3]
print(list(set(ls)))